# CitySet Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CitySet Members
CitySet Class Constructors Methods Properties See Also
---
The CitySet type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CitySet | Initializes a new instance of the CitySet class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Removes every city from the set, rendering it empty. |
| Contains | Tests for the existence of a city within the set. |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| Erase | Removes a specified city from the set. |
| ForwardIterator | Retrieve a forward moving iterator to the set. |
| GetEnumerator | Retrieve a forward moving iterator to the set. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Insert | Insert the specified city into the set. |
| ReverseIterator | Retrieve a backward moving iterator to the set. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the set is empty. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| Size | Returns the number of cities that are in the set. |

# See Also
CitySet Class
Autodesk.Revit.DB Namespace